In [1]:
import os
import pandas as pd
import numpy as np

#### Read the csv into a dataframe

In [2]:
# read in the data to a pandas dataframe
q2 = pd.read_csv ('Q2\\q2.csv')
q3 = pd.read_csv ('Q3\\q3.csv')
q4 = pd.read_csv ('Q4\\q4.csv')

#### Creat a function to identify NaNs and unique values

In [3]:



def unique_val(df):
    '''Get the unique values of each column'''

    uniq_values = []
    values = []
    feature = []
    is_NaN = []  # Initialize a list to store whether NaN values are present
    
    index_value_tuples = list(df.nunique().items())
    for index, value in index_value_tuples:
        feature.append(index)
        uniq_values.append(value)
        
        # Replace "nan" with actual NaN values in the unique values list
        unique_vals = df[index].unique()
        unique_vals = [np.nan if val == 'nan' else val for val in unique_vals]
        values.append(unique_vals)
        
        # Check if there are NaN values in unique_vals
        if any(pd.isna(unique_vals)):
            is_NaN.append('Yes')
        else:
            is_NaN.append('No')
        
    # Create a DataFrame to store the feature types
    df_out = pd.DataFrame({'Feature': feature,
                           'Unique_values': uniq_values,
                           'is_NaN': is_NaN,
                           'Values': values})
    return df_out

In [4]:
unique_val(q2)

,Feature,Unique_values,is_NaN,Values
0,01 - Rental Details Rental ID,1108163,No,"[22178529, 22178530, 22178531, 22178532, 22178..."
1,01 - Rental Details Local Start Time,957330,No,"[2019-04-01 00:02:22, 2019-04-01 00:03:02, 201..."
2,01 - Rental Details Local End Time,922638,No,"[2019-04-01 00:09:48, 2019-04-01 00:20:30, 201..."
3,01 - Rental Details Bike ID,5764,No,"[6251, 6226, 5649, 4151, 3270, 3123, 6418, 451..."
4,01 - Rental Details Duration In Seconds Uncapped,13769,No,"[446.0, 1,048.0, 252.0, 357.0, 1,007.0, 257.0,..."
5,03 - Rental Start Station ID,610,No,"[81, 317, 283, 26, 202, 420, 503, 260, 211, 30..."
6,03 - Rental Start Station Name,610,No,"[Daley Center Plaza, Wood St & Taylor St, LaSa..."
7,02 - Rental End Station ID,612,No,"[56, 59, 174, 133, 129, 426, 500, 499, 211, 23..."
8,02 - Rental End Station Name,612,No,"[Desplaines St & Kinzie St, Wabash Ave & Roose..."
9,User Type,2,No,"[Subscriber, Customer]"
10,Member Gender,2,Yes,"[Male, Female, nan]"
11,05 - Member Details Member Birthday Year,84,Yes,"[1975.0, 1984.0, 1990.0, 1993.0, 1992.0, 1999...."

In [5]:
unique_val(q3)

,Feature,Unique_values,is_NaN,Values
0,trip_id,1640718,No,"[23479388, 23479389, 23479390, 23479391, 23479..."
1,start_time,1372358,No,"[2019-07-01 00:00:27, 2019-07-01 00:01:16, 201..."
2,end_time,1344539,No,"[2019-07-01 00:20:41, 2019-07-01 00:18:44, 201..."
3,bikeid,5787,No,"[3591, 5353, 6180, 5540, 6014, 4941, 3770, 544..."
4,tripduration,16676,No,"[1,214.0, 1,048.0, 1,554.0, 1,503.0, 1,213.0, ..."
5,from_station_id,612,No,"[117, 381, 313, 168, 300, 43, 511, 24, 624, 23..."
6,from_station_name,612,No,"[Wilton Ave & Belmont Ave, Western Ave & Monro..."
7,to_station_id,613,No,"[497, 203, 144, 62, 232, 195, 84, 24, 43, 237,..."
8,to_station_name,613,No,"[Kimball Ave & Belmont Ave, Western Ave & 21st..."
9,usertype,2,No,"[Subscriber, Customer]"
10,gender,2,Yes,"[Male, nan, Female]"
11,birthyear,86,Yes,"[1992.0, nan, 1990.0, 1995.0, 1970.0, 1993.0, ..."

In [6]:
unique_val(q4)

,Feature,Unique_values,is_NaN,Values
0,trip_id,704054,No,"[25223640, 25223641, 25223642, 25223643, 25223..."
1,start_time,633380,No,"[2019-10-01 00:01:39, 2019-10-01 00:02:16, 201..."
2,end_time,632834,No,"[2019-10-01 00:17:20, 2019-10-01 00:06:34, 201..."
3,bikeid,5670,No,"[2215, 6328, 3003, 3275, 5294, 1891, 1061, 127..."
4,tripduration,10401,No,"[940.0, 258.0, 850.0, 2,350.0, 1,867.0, 373.0,..."
5,from_station_id,610,No,"[20, 19, 84, 313, 210, 156, 336, 77, 198, 66, ..."
6,from_station_name,610,No,"[Sheffield Ave & Kingsbury St, Throop (Loomis)..."
7,to_station_id,608,No,"[309, 241, 199, 290, 382, 226, 142, 463, 336, ..."
8,to_station_name,608,No,"[Leavitt St & Armitage Ave, Morgan St & Polk S..."
9,usertype,2,No,"[Subscriber, Customer]"
10,gender,2,Yes,"[Male, Female, nan]"
11,birthyear,77,Yes,"[1987.0, 1998.0, 1991.0, 1990.0, 1994.0, 1995...."

#### Make the headers Uniform

In [7]:
#use the header of q3 for q2
for i in range(len(q2.columns)):
    q2 = q2.rename(columns={q2.columns[i]: q3.columns[i]})
    q4 = q4.rename(columns={q4.columns[i]: q3.columns[i]})

In [8]:
# remove headers for q3 and q4
q3_no_header = q3.rename(columns={col: None for col in q3.columns})
q4_no_header = q4.rename(columns={col: None for col in q4.columns})

In [9]:

files = [q2,q3,q4]
df = pd.concat(files, ignore_index=True)

In [10]:
df.head()

,trip_id,start_time,end_time,bikeid,tripduration,from_station_id,from_station_name,to_station_id,to_station_name,usertype,gender,birthyear
0,22178529,2019-04-01 00:02:22,2019-04-01 00:09:48,6251,446.0,81,Daley Center Plaza,56,Desplaines St & Kinzie St,Subscriber,Male,1975.0
1,22178530,2019-04-01 00:03:02,2019-04-01 00:20:30,6226,"1,048.0",317,Wood St & Taylor St,59,Wabash Ave & Roosevelt Rd,Subscriber,Female,1984.0
2,22178531,2019-04-01 00:11:07,2019-04-01 00:15:19,5649,252.0,283,LaSalle St & Jackson Blvd,174,Canal St & Madison St,Subscriber,Male,1990.0
3,22178532,2019-04-01 00:13:01,2019-04-01 00:18:58,4151,357.0,26,McClurg Ct & Illinois St,133,Kingsbury St & Kinzie St,Subscriber,Male,1993.0
4,22178533,2019-04-01 00:19:26,2019-04-01 00:36:13,3270,"1,007.0",202,Halsted St & 18th St,129,Blue Island Ave & 18th St,Subscriber,Male,1992.0

#### Confirm we do not have columns name in the row

In [11]:
df.head()

,trip_id,start_time,end_time,bikeid,tripduration,from_station_id,from_station_name,to_station_id,to_station_name,usertype,gender,birthyear
0,22178529,2019-04-01 00:02:22,2019-04-01 00:09:48,6251,446.0,81,Daley Center Plaza,56,Desplaines St & Kinzie St,Subscriber,Male,1975.0
1,22178530,2019-04-01 00:03:02,2019-04-01 00:20:30,6226,"1,048.0",317,Wood St & Taylor St,59,Wabash Ave & Roosevelt Rd,Subscriber,Female,1984.0
2,22178531,2019-04-01 00:11:07,2019-04-01 00:15:19,5649,252.0,283,LaSalle St & Jackson Blvd,174,Canal St & Madison St,Subscriber,Male,1990.0
3,22178532,2019-04-01 00:13:01,2019-04-01 00:18:58,4151,357.0,26,McClurg Ct & Illinois St,133,Kingsbury St & Kinzie St,Subscriber,Male,1993.0
4,22178533,2019-04-01 00:19:26,2019-04-01 00:36:13,3270,"1,007.0",202,Halsted St & 18th St,129,Blue Island Ave & 18th St,Subscriber,Male,1992.0

In [12]:
df[df['start_time']== 'start_time']

Empty DataFrame
Columns: [trip_id, start_time, end_time, bikeid, tripduration, from_station_id, from_station_name, to_station_id, to_station_name, usertype, gender, birthyear]
Index: []

#### Check for the data types

In [13]:
from pandas.api.types import is_numeric_dtype

def featureType(df):
    # Get the column names and the number of rows in the DataFrame
    columns = df.columns
    rows = len(df)
    
    # Initialize empty lists to store the base feature types and analysis feature types
    colTypeBase = []
    colType = []
    
    # Iterate over each column in the DataFrame
    for col in columns:
        try:
            uniq = df[col].nunique()
            
            # Check if the number of rows is greater than 10
            if rows > 10:
                if is_numeric_dtype(df[col]):
                    # Numeric columns
                    if uniq == 1:
                        colType.append('Unary')
                        colTypeBase.append('Unary')
                    elif uniq == 2:
                        colType.append('Binary')
                        colTypeBase.append('Binary')
                    elif rows / uniq > 3 and uniq > 5:
                        colType.append('Continuous')
                        colTypeBase.append('Continuous')
                    else:
                        colType.append('Continuous-Ordinal')
                        colTypeBase.append('Ordinal')
                else:
                    # Categorical columns
                    if uniq == 1:
                        colType.append('Unary')
                        colTypeBase.append('Category-Unary')
                    elif uniq == 2:
                        colType.append('Binary')
                        colTypeBase.append('Category-Binary')
                    else:
                        colType.append('Categorical-Nominal')
                        colTypeBase.append('Nominal')
            else:
                # For small datasets, simply classify columns as numeric or non-numeric
                if is_numeric_dtype(df[col]):
                    colType.append('Numeric')
                    colTypeBase.append('Numeric')
                else:
                    colType.append('Non-numeric')
                    colTypeBase.append('Non-numeric')
        except:
            colType.append('Issue')
    
    # Create a DataFrame to store the feature types
    df_out = pd.DataFrame({'Feature': columns,
                           'BaseFeatureType': colTypeBase,
                           'AnalysisFeatureType': colType})
    return df_out

In [14]:
featureType(df)

              Feature  BaseFeatureType  AnalysisFeatureType
0             trip_id          Ordinal   Continuous-Ordinal
1          start_time          Nominal  Categorical-Nominal
2            end_time          Nominal  Categorical-Nominal
3              bikeid       Continuous           Continuous
4        tripduration          Nominal  Categorical-Nominal
5     from_station_id       Continuous           Continuous
6   from_station_name          Nominal  Categorical-Nominal
7       to_station_id       Continuous           Continuous
8     to_station_name          Nominal  Categorical-Nominal
9            usertype  Category-Binary               Binary
10             gender  Category-Binary               Binary
11          birthyear       Continuous           Continuous